{
  "users": [
    [
      "test-user-id",
      {
        "id": "test-user-id",
        "email": "test@example.com",
        "name": "Test User",
        "password": "hashed-password",
        "createdAt": "2025-08-11T03:14:58.946Z",
        "updatedAt": "2025-08-11T03:14:58.946Z"
      }
    ],
    [
      "kxa1popuq",
      {
        "id": "kxa1popuq",
        "email": "mhemd.masa@gmail.com",
        "name": "mhemd 139",
        "googleId": "107105825390967240165",
        "avatar": "https://lh3.googleusercontent.com/a/ACg8ocIpozgLcAYaoO_jrz3Gl6-yt2rt_5EJjO2f0iVnesfxuZsRs30=s96-c",
        "createdAt": "2025-08-11T03:19:40.738Z",
        "updatedAt": "2025-08-11T03:19:40.738Z"
      }
    ]
  ],
  "pdfs": [
    [
      "puhtwh6fa",
      {
        "id": "puhtwh6fa",
        "userId": "kxa1popuq",
        "name": "pdf-1754940918721-526789154.pdf",
        "originalName": "A_Low-Power_Microcontroller_with_Accuracy-Controll.pdf",
        "size": 1623553,
        "filePath": "uploads\\pdf-1754940918721-526789154.pdf",
        "s3Key": "pdfs/kxa1popuq/1754940918734-920317897.pdf",
        "s3Url": "https://chatpdf-storage-139.s3.eu-north-1.amazonaws.com/pdfs/kxa1popuq/1754940918734-920317897.pdf",
        "pages": 10,
        "status": "ready",
        "uploadedAt": "2025-08-11T19:35:19.914Z",
        "processedAt": "2025-08-11T19:35:21.201Z",
        "chunks": [
          "Research Article\nA Low-Power Microcontroller with\nAccuracy-Controlled Event-Driven Signal Processing\nUnit for Rare-Event Activity-Sensing IoT Devices\nDaejin Park,\n1\nJonghee M.  Youn,\n2\nand Jeonghun Cho\n1\n1\nSchool of Electronics Engineering, Kyungpook National University, 80 Daehakro, Bukgu, Daegu 702-701, Republic of Korea\n2\nDepartmentofComputerEngineering,YeungnamUniversity,280Daehak-Ro,Gyeongsan,Gyeongbuk712-749,RepublicofKorea\nCorrespondence should be addressed to Jonghee M.  Youn;youn@yu. ac. kr and Jeonghun Cho; jcho@ee. knu. ac. kr\nReceived 8 January 2015; Accepted 23 March 2015\nAcademic Editor: Young-Sik Jeong\nCopyright © 2015 Daejin Park et al.  This is an open access article distributed under the Creative Commons Attribution License,\nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.",
          "A specially designed microcontroller with event-driven sensor data processing unit (EPU) is proposed to provide energy-efficient\nsensor data acquisition for Internet of Things (IoT) devices in rare-event human activity sensing applications Rare-event sensing\napplications using a remotely installed IoT sensor device have a property of very long event-to-event distance, so that the inaccurate\nsensor data processing in a certain range of accuracy error is enough to extract appropriate events from the collected sensing data. \nThe proposed signal-to-event converter (S2E) as a preprocessor of the conventional sensor interface extracts a set of atomic events\nwith the specific features of interest and performs an early evaluation for the featured points of the incoming sensor signal.  The\nconventional sensor data processing such as DSPs or software-driven algorithm to classify the meaningful event from the collected\nsensor data could be accomplished by the proposed event processing unit (EPU).",
          "The proposed microcontroller architecture\nenables an energy efficient signal processing for rare-event sensing applications The implemented system-on-chip (SoC) including\nthe proposed building blocks is fabricated with additional 7500 NAND gates and 1-KB SRAM tracer in 0. 18 um CMOS process,\nconsuming only 20% compared to the conventional sensor data processing method for human hand-gesture detection. \n1.  Introduction\nNowadays, sensor devices with wireless connectivity such as\nWi-Fi, Bluetooth, and ZigBee are becoming important in IoT\napplications.  Human activity monitoring based on sensed\nsignal analysis [1,2] is becoming a popular application using\nbiomedical computing technology.  Body-attached sensors\nmeasure the electrical signal converted by a biomedical\ninterface [3].  Observation-based remote sensors are also used\nto monitor the movement of the human body [4].",
          "As described inFigure 1,theremotelyinstalledsmartsen-\nsor system monitors the environment periodically and trans-\nfers the collected sensor data via wireless interface to the host\nsystem such as a Web server These wireless sensor devices are\npowered by the on-board battery with limited capacity. \nBattery recharging and replacement are very inconve-\nnient procedures and a major obstacle in extending various\nIoT-based applications.  Long operating lifetime of the sensor\nsystems is therefore an important requirement in designing\nthe system architecture and the sensor data processing algo-\nrithm. \nThe energy consumption in the sensor systems is caused\nby sampling the sensor signal, processing the sampled data,\nand transferring the collected data to the host machine via\nwireless interface.  Traditional sensor devices sample the sig-\nnal periodically and analyze the sensed data.",
          "This approach has advantages requiring the simple pro-\ncessing unit in terms of hardware resource and the general-\nizedalgorithmintermsofsoftwaredevelopmentSyntactic\nactivation of the entire sensor system results in more power\nconsumption, especially in wireless connectivity. \nThe conventional sensing platform for human activity\nmonitoring uses general purpose microcontrollers (MCUs),\nincluding an analog sensor interface, discrete-time analog-to-\ndigital converter (ADC) as a data sampler, and a sensor data\nprocessing unit to analyze collected data. \nHindawi Publishing Corporation\nJournal of Sensors\nVolume 2015, Article ID 809201, 10 pages\nhttp://dx. doi. org/10.",
          "1155/2015/809201\n\n2Journal of Sensors\nSensor\nSampler\nProcessor\nWireless \nI/F\nChange of state\nInterested \nstate change\nRecognized \nevent\nMonitoring\nNotify\nElectrical \nsignal\nSampled \nsignal\nRecognized \nevent\n(i) Event arrival time \ndelay/skip allowable,\n(ii) Event presence is more \nimportant than data itself \nObserverGenerator\nIntended \nevent\nBattery-operated sensor-driven \nIoT device\nObserver\n→ Long-term operation is more important than accurate operation\n(i) Low frequency event generation \n(ii) Secondary retry allowable (average) \n(iii) Event type is predefined \n(signal shape is expected)\nGenerator\nTr i g g e r e d  \nevent\nFigure 1: Sensor-based IoT device concept with sensor interface, processing unit, and wireless connectivity",
          "However, this approach, by which the sensed data is\nanalyzed on the microlevel of data-to-data, has operating\npower overhead because it is not optimized to consider the\nlong event-to-event distance of human activity signals, which\nis easily observed in rare-event sensing applications [4,5]\nIn this paper, for efficient sensor data processing in the\nenergy consumption, a semantic sampling method is intro-\nduced to capture the signal with the features of interest and is\nimplemented as a preprocessor unit named to signal-to-event\nconverter (S2E), which generates the atomic events instead\nof the sampled data itself.  The extracted atomic events are a\nrelatively small number of samples compared to the syntac-\ntic sample data by conventional analog-to-digital converter\n(ADC) as a signal-to-data converter (S2D). \nThe proposed S2E replaces the conventional S2D to ext-\nract atomic events from the incoming sensor signal.",
          "The event\nidentification from human activity monitoring is performed\nby the event-driven sensor data processing unit (EPU) for the\nsmall set of extracted atomic events\nThis paper is organized as follows.  In Sections2and\n3, our research motivation and related work are discussed. \nSection 4describes the details of the proposed architecture. \nThe implementation and experimental results are presented\ninSection 5.  Finally, we conclude the paper by summarizing\nour contributions inSection 6. \n2.  Motivation\nThe key motivation of the proposed method begins with the\ntransition to macrolevel processing of the sensor signal by\nS2E instead of the conventional microlevel analysis for the\nsensed dataset. Figure 2shows the method we used to repre-\nsent the sensor signal acquisition result in the event data\nspace.  The human activity sensor signals are represented by\nthe attributes of interest and the elapsed time relationship\nbetween the atomic events inFigure 2(a).",
          "The monitored\nhuman activity is encoded as a set of atomic events by the\nevent quantization inFigure 2(b)\nTo address this limitation of the conventional digital\nsystem architecture by using the discrete time-based sensor\ndata processing method, we propose an event-driven system\narchitecture that modifies traditional digital system design. \nWe present a theoretical framework to implement an event-\ndriven sensor processor for general rare-event sensing appli-\ncations by analyzing the system operations. \n2. 1.  Event-Space Signal Representation. Our main research\nbegins with an event-space representation of the signal,\ninstead of the digital data space domain.  The extracted fea-\ntures of the sensed signal are encoded into the elapsed time\nbetween events and informative value such as voltage level\nand edge phase crossing the trigger point of the signal.",
          "The\nfundamental event defined, which is defined as an atomic\nevent with the most important information, provides a signal\nrepresentation on an abstract level and reduces the com-\nputational complexity in performing basic data processing\nfor extracted informative features of interest The collected\natomic events include partial information in the original\nsignal that specifies whether the desired featured points of the\nsignal are present. \n2. 2.  Accuracy-Controlled Event Quantization. The event-\nquantization concept extends the time-quantization method\nfor signal representation that uses elapsed time to enhance the\nconventional data-sampling and processing method.  Time\nquantization monitors only the specific conditions of the\nsignal transition and captures the time-stamps.  The event-\nquantization method also determines whether the specified\ncharacteristics of the signal exist. \n2. 3.  Event-Driven Sensor Data Processing.",
          "The event-based\napproach, with a certain amount of accuracy error, is des-\ncribed by the proposed event-driven sensor data processing\nflow The input signal is monitored with specified interest-of-\nsignal characteristics to generate the specific atomic events of\nthe signal.",
          "The set of atomic events during the specified region\n\nJournal of Sensors3\nActivity raw data\nTa r g e t\nEvent quantization\nHuman activity signal acquisition and event quantization\nattribute and time of interest\nrepresentation\nDistance\ns(t)\nt\ns(t)\n(1)\nth\nk\n:attribute of interest\n(2)Φ: edge phase\n(3) et\ni\n: elapsed time\nth\nc\nth\nb\nth\na\naev\n1\naev\n2\naev\n3\naev\n4\naev\n5\naev\n0\nAEV\n㨀㨀㨀→\n={aev\ni\n|aev\ni\n=⟨(th\nk\n,Φ),et\ni\n⟩}:\n(a) Attribute and its corresponding elapsed time representa-\ntion\nt\nSensor signal \nspace\nEvent data space\nt\net\n0\n=⟨E\na\n,et\n0\n⟩\net\n2\n=⟨E\na\n,et\n2\n⟩\net\n1\n=⟨E\nb\n,et\n1\n⟩\net\n3\n=⟨E\nb\n,et\n3\n⟩\net\n4\n=⟨E\nc\n,et\n4\n⟩\net\n5\n=⟨E\nd\n,et\n5\n⟩\nE\na\nE\nb\nE\nc\nE\nd\naev\n1\naev\n2\naev\n3\naev\n4\naev\n5\naev\n0\n(b) An example of event-space representation for incoming sensor signal\nFigure 2: Human activity sampled data representation in event data space",
          "of the signal are traced into the tracer memory as an event\nvector, which contains the sequence of the atomic events and\nthe time-distance relationship between the atomic events The\ntraced event vector identifies the approximate result as a final\nevent by comparing it to the expected rules of the atomic\nevents. \nThese approximation approaches enable us to reduce the\ncomputational complexity in order to manipulate a large\namount of collected sensing data.  As a result, power con-\nsumption will be reduced.  For applications related to human\ninteraction, an approximation approach enables developers\nto design the computational block using smaller hardware\nresources, while providing sufficient performance in limited\nresolution of the accuracy. \nIn accuracy-controlling approaches defined from the\nspecifications,ourstudyfocusedonthedata-representation\nresolution, the timing-resolution of the sampling frequency,\nand the response time as a delay time [6].",
          "This enables the\nconfiguration of the operation accuracy in the processor\narchitecture level according to the abstraction level of the pro-\nposed event-quantization approach\n3.  Related Work\nTo overcome the weakness of inefficient power consumption\nby the frequent CPU wake-up for the discrete time sampling,\ncontinuous-time signal processing techniques [7,8]have\nbeen proposed in previous literature.  If a certain condition\nof the signal status, such as the voltage level at a specific time,\nis matched with the user-defined condition [9,10], the time\nvalue at the triggered condition is sampled and quantized\n[5] by the selective method, which also helps to reduce\noperational power [11]. \nThe continuous-time sampling method was introduced to\nimprove the syntactic sampling and processing approach in\ntermsofpowerconsumption,butitrequiresadditionalhard-\nware resources and more computational time for the time-\ndistance calculation, which gives rise to additional power\nconsumption.",
          "The required power and hardware resource\noverhead, which are needed to compensate for reduced wake-\nup power consumption, must be considered in order to\nachieve benefits in total energy efficiency due to hardware-\nenergy trade-off\nThe trade-off in terms of energy and accuracy has been\nstudied widely [12,13].  To obtain long lifetime operations\nunder limited battery power [14], the latest research intro-\nduces inaccurate computation techniques [15,16]withappro-\nximation-based hardware designs. \nThe proposed sensor processor for the rare-event sensing\napplications adopts the event-driven approach of the conti-\nnuous-time sampling method.  Inaccurate time-data manip-\nulation reduces computational complexity and sampling res-\nolution by determining the presence of featured events in the\nspecific range.  The event-detection accuracy can be adjusted\nby making the trade-off between the processing energy con-\nsumption and the operating specification. \n4.  Proposed Architecture\n4. 1.",
          "Application-Dependent ConstraintsFigure 4shows the\ndifference between the discrete time samples and the featured\nevents of interest, with the common shape of the rare-event\nsensor signal.  Event sources, such as hand gestures, proximity,\nand object activity, generate signal pulses for which the\ndistance between featured points of the signal is very long. \nThe number of data samples (푛) is greater than the number\nof events (푚). Inthiswork,weassumedanapplication-\nspecific constraint of rare-event characteristics, which result\nin a small number of events compared to the number of data\nsamples.",
          "4Journal of Sensors\ns(t)\nData tracing\nDigital data\nSignal features \nof interest\nData\nprocessing\nData sequence\nS2D \n(ADC)\nFinal event\nExpected data \nsequence\nd\ni\n{d\ni\n}\nev\nj\n(a) Data sampling and lazy evaluation for syntactic data processing\nSignal feature\nSensor event \n(/w error)\nS2E \n(AEG)\ns(t)\nEvent tracing\nSignal feature of \ninterest\nAtomic event\nprocessing\n(EPU)\nAtomic \nevent sequence\nExpected atomic \nevent sequence\nIdentified \nfinal event\nEvent data\nError bound is allowable\ñ\ne\nv\nΔ\ne\naev\ni\n{aev\ni\n}\n(b) Event sampling by early evaluation and event processing\nFigure 3: Event sampling based on signal-to-event (S2E) and event-driven data processing\nTime\nTime\ns(t)\ns(t)\ns(t)\nLong-term no activity\nTime\nLong-term no activity\nTime\nn>m,n≈m\nth\ni\n=Δ∗i\nth\ni\n=Δ∗i\nth\ni\n=Δ∗i\nL\ni\n=Δ∗i\nt\nk\n=Δ\nt\n∗k\nd\nm,k\nt\nm\n=Δ\nt\n∗m\ne\nm\n㰀\n,m\nt\nm\n㰀\n=Δ\nt\n∗m\n㰀\nRare-event applications:d\nm,k\n≫e\nm\n㰀\n,m\nn≫m: rare event applications\nFigure 4: Wake-up frequency for data sampling and event-driven\nsampling.",
          "The event-quantization accuracy depending on the res-\nolution of the elapsed time-stamp is described as푒\n푚\n耠\n,푚\nin\nFigure 4 The rare-event sensing applications, in which the\nevent-to-event duration is relatively larger than the accuracy\nerror, have the following application-specific constraints:\n푑\n푚,푘\n≫푒\n푚\n耠\n,푚\n. \n(1)\nWith these application-specific constraints in(1),the\nevent identification accuracy error caused by the inaccurate\ntime-stamp measurement clock is relatively insensitive.  The\nrecognized event observer, such as the human eye, allows for\na certain amount of inaccuracy in identifying the meaning of\nthe events, which are constructed by the proposed inaccurate\nevent-driven sensor processor.",
          "The proposed sensor processor is designed with these\napplication-specific constraints by reducing the accuracy of\nthe time-stamp measurement clock, decreasing the bit width\nof the timer block to capture the time-stamps, and decreasing\nthe operational complexity of the time-to-time distance mea-\nsurement blocks, which are specially implemented as a ded-\nicated accelerator for event recognition in the implemen-\nted hardware\n4. 2.  Atomic Event Quantization. The conventional MCU per-\nforms data sampling in the ADC unit, data tracing in buffer\nmemory, and digital data processing to identify the original\nevent generated by event sources, such as a swipe gesture.  The\nsyntactic sampling is performed without the consideration of\nthe incoming signal property.  Then, the lazy evaluation using\nthe features of interest is performed to generate the final event\nev\n푖\nusing a large number of sampled data{푑\n푖\n}.",
          "This syntactic\ndata sampling and lazy evaluation in conventional MCU is\nillustrated inFigure 3(a)\nThe proposed EPU can perform the event relationship\nanalysis with a reduced computation overhead for the smaller\nset of atomic events.  The signal abstraction by extracting\natomic events as signal shape in S2E leads to accuracy error\nin identifying the final event.  The overall procedure of the\nevent-driven processing in the modified MCU is described\ninFigure 3(b). \nThe event-driven signal sampling in the proposed archi-\ntecture captures the signal shapes of interest using the feature\nscanning window, which determines the presence of the\nexpected features of the signal.",
          "The feature scanning window\ninFigure 5(a)is configured to capture the specific signal\n\nJournal of Sensors5\nAccuracy-controlled \n(approximation)\nL\nf\nT\nr\nT\nstart\nT\nend\nConfiguration of feature scanning window\nD\nmax\nΩ\ni\n=(L\nf\n,T\nr\n,D\nmax\n,T\nstart\n,T\nend\n)\n(a) Configuration of signal scanning window for\natomic event extraction\nAEG\nSensor analog \nsignal: s(t)\nAtomic \nevent\nf: Ω → E\nΩ={Ω\ni\n: set of signal segments}\nE=    : set of atomic events}\n{aev\ni\n{aev\ni\n}\n(b) Atomic event generator definition\nTimer window\nTimer\nTimer end\nR\nr\nR\nr\nR\nr\nR\nf\nR\nf\nR\nf\nR\nf\n>D\nmax\nR\nf\n>D\nmax\nD\nmax\nR\nr\n>D\nmax\nR\nr\n>D\nmax\nR\nf\n>D\nmax\nR\nr\n>D\nmax\n∞∞\nL\nprobe\nL\nprobe\nL\nprobe\nL\nprobe\nL\nprobe\nL\nprobe\nTime measurement\nwindow\nstart\nStep-up (R\nsu\n)\nStep-down (R\nsd\n)\nDown-pulse (R\ndp\n)\n∞-step-up (R\nisu\n)∞-step-down (R\nisd\n)\nUp-pulse (R\nup\n)\n(c) Examples of set of signal segmentΩ\nElapsed-time sweep of feature point\nSweep of featured level\nEquivalent to discrete \ntimed sampling\nSignal segmentation\nL\nr1\nL\nr1\nL\nr1\nL\nr1\nL\nr1\nL\nr1\nT\nr1\nT\nr1\nT\nr1\nT\nr1\nT\nr2\nT\nr2\nT\nr3\nT\nr3\nT\nstart\nT\nstart\nT\nend\nT\nend\n···",
          "⋱\n(d) Representing various atomic events according to featured points\nFigure 5: Atomic event generator (AEG) based on feature scanning window and signal segmentation\nshape.  This configuration is represented with the set of signal\nsegmentsΩinFigure 5(b). \nThe S2E includes the atomic event generator (AEG) unit\nto generate a set of atomic events by using the user-defined\nsetofsignalsegmentsΩ.  Examples of the user-defined signal\nsegmentsΩare introduced inFigure 5(c). \nFigure 7describes our approach to capture the signal\nshape as an atomic event crossing a certain range of arrival\ntime.  To more formally define our approach, we begin our\nexplanation by first presenting the following definitions. \nDefinition 1.",
          "Given continuous signal푠(푡),letAEV={aev\n푖\n|\naev\n푖\n=(aev\n푖−1\n,value,phase,et)}be a sequence of an atomic\nevent aev\n푖\ncrossing the specific level and time condition with\na relationship of previous atomic event aev\n푖−1\n, where aev\n푖\n⋅\nvalue is a result of the approximation-based data quantization\nfunction ADQ and aev\n푖\n⋅et is a result of the approximation-\nbased time quantization function ATQ, described as follows:\ñ\n푑\n푘\n=ADQ(푠 (푡\n푘\n),퐿\n푚\n,Δ\n푑\n,푢,V),\n∀Δ\n푑\n∗푢<\n儨\n儨\n儨\n儨\n퐿\n푚\n−푑\n푘\n儨\n儨\n儨\n儨\n<Δ\n푑\n∗V\ñ\n푡\n푘\n=ATQ(aev\n푖\n⋅et,\ñ\n푇\nclk\n),where\ñ\n푇\nclk\n=푇\nclk\n+Δ\n푡\n\n(2)\nThe meet condition푘, when the expected crossing is\npresent, is described in the following equation:\ñ\n푡\n푘\n=et+\ñ\n푇\nclk\n∗푘,  ∀DQ(푠 (\ñ\n푡\n푘\n)) =\ñ\n푑\n푘\n.",
          "(3)\nAs shown in Figures5(a)and5(b),theAEGbuildsanele-\nment with the attributes, which are encoded with the digitized\n\n6Journal of Sensors\nBegin with initial configuration\nAdjusting sampling frequency\nSignal feature \ndetermination\nSample frequency,\ntrigger threshold \nlevel configuration\nSampled data signal\nprocessing\nIterative configuration of sampling \nspeed, threshold level\nAdjusting reasonable sample\nand processing method\ns(t): incoming sensor data signal\n1\n2\n(a) Syntactic procedure to determine conventional data sampling frequency\nSignal shape \nsegmentation\nSignal segment region, \nsignal-to-event set \nconfiguration (features)\nSampled event data \nprocessing\nGrouping/ungrouping \nof signal segments\nSignal segment selection \n(S2E configuration)\nBegin from fundamental atomic event set\n1\nExtend the event sampling window by \ngrouping the adjacent event \n2\nΩ\n0\nΩ\n0\nΩ\n1\nΩ\n1\nΩ\n2\nΩ\n2\nΩ\n3\nΩ\n3\nΩ\n4\nΩ\n4\nL\nf0\nL\nf0\nL\nf0\nL\nf1\nD\nr0\nD\nr0\nD\nr1\nD\nr1\nT\nr0\nT\nr0\nT\nr1\nT\nr1\nT\nstart0\nT\nstart0\nT\nstart1\nT\nstart1\nT\nend0\nT\nend0\nT\nend1\nT\nend1\nER\n0\nER\n0\nER\n1\nER\n1\nER\n2\nER\n2\nER\n3\nER\n3\nER\n4\nER\n5\n(b) Iterative procedure to determine appropriate event segmentation set\nFigure 6: Iterative procedure to determine sampling method and signal segments for the sensor signal",
          "signallevel,elapsedtime,andedgephaseinthefollowing\nequation:\nAEG\n(\n푠\n(\n푡\n)\n,퐿\n)\n={aev\n푖\n|aev\n푖\n=⟨aev\n푖−1\n,\ñ\n푑\n푘\n,휙\nedge\n,\ñ\n푡\n푘\n⟩} \n(4)\nFrom(4), the extracted information, as an atomic event,\nis encoded with the approximation value of the signal level,\nthe reduced time quantization value of the elapsed time, and\nthe relationship of the previous atomic event aev\n푘−1\n. \n4. 3.  Atomic Event Extraction. The event-quantized signal\nrepresentation is dependent on the event slice resolution of\nthe configured set of signal segments, which is described in\nFigure 5(d).  The number of feature points and the window\nsize determines the accuracy of the signal representation by\nthe extracted atomic events. Figure 5(d)shows the capability\nto represent various signal shapes with the configuration of\n퐿\n푟\n,퐷\nmax\n,푇\n푟\n,푇\nstart\n,푇\nend\nin the feature scan window. \nDefinition 2.",
          "Given the configured feature scanning window\nto extract the atomic events from푠(푡),let푇\nstart\nbe a start time\nmonitoring the signal, let푇\nend\nbe the end of monitoring the\nsignal, let퐿\n푟\nbe a rising signal level at which the time-stamp\nis푇\n푟\n,let퐿\n푓\nbe a falling signal level at which the time-stamp\nis푇\n푓\n,letthepairof퐿\n푥\nand푇\n푦\nbe featured point, and let퐷\nmax\nbeamaximumtimevalueinwhichthefeaturedpointsare\npresent The set of signal segments described by the config-\nurationΩ={Ω\n푖\n|Ω\n푖\n=(푇\nstart\n,푇\nend\n,퐿\n푟\n,퐿\n푓\n,푇\n푟\n,푇\n푓\n,퐷\nmax\n)}\nof the featured scanning window is defined asΩ,andthey\nare used to extract the atomic events of interest for the AEG\nfunction, which is defined as follows:\n{aev\n푖\n}=AEG\n(\n푠\n(\n푡\n)\n,Ω\n)\n. \n(5)\nΩ\nup\ndefines a signal segment of the feature scanning win-\ndow with the “up-pulse” type in the first part ofFigure 5(c). \nIn our applications,{Ω\ntype\n|t y p e = “up”, “s u”, “s d”, “dp”, “ i s u”,\n“isd”}is used.",
          "One signal shape can be divided into several slices by\nuser-defined signal segmentation If the time window for\nsignal segmentation is the same as the fixed width푡\n푠\nin the\ndiscrete time sampling method, the result of the atomic event\ngeneration is equivalent to that of the discrete time sampling. \nThe proposed atomic event generation approach enables a\ntrade-off between the signal extraction accuracy and its pro-\ncessing power consumption. \nThe application-specific constraints in configuring the\nset of signal segments must be considered for the accuracy-\nenergy trade-off to provide reasonable accuracy of event\nidentification with limited energy consumption. Figure 6\nshows the determination procedure of the signal segments\nto represent the sensed signal with small set of signal seg-\nments.",
          "A reasonable slice of the signal segmentation can be\n\nJournal of Sensors7\nTime\nMagnitude\nEvent capture approach by determining the presence of next\nexpected atomic event in error range (active + passive)\n: Event quantization\nElapsed \ntime: et\nsample\n2nd: detail\n1st: wait\ñ\nt\nk\n=et+\ñ\nT\nclk\n∗k\n=⟨\n−1\n,\ñ\nd\nk\n,Φ\nedge\n,\ñ\nt\nk\n⟩\naev\ni−1\naev\ni\naev\ni\nΔ\nd\n·uΔ\nd\n·\u0012\n<|L\nm\n−d\nk\n|<\nFigure 7: Event sample by capturing the specific features of interest\nand elapsed time\ndetermined by the iterative configuration to provide enough\nevent identification performance with reasonable energy\nconsumption. \nFigure 6(a)shows an example of searching reasonable\nsampling frequency.  The red colored sample can be obtained\nby adjusting the sampling frequency after the specified activ-\nity signal is analyzed. Figure 6(b)describes the procedure of\ngrouping a set of signal segments into another signal segment,\nwhich can represent the activity signal with a smaller number\nof atomic events. \n4. 4.",
          "Event-Driven Sensor Data ProcessingThe AEG scans the\ncontinuous signal푠(푡)passing through the configured feature\nscan window to determine the presence of the signal shapes\nof interest, as shown inFigure 8.  The set of atomic events is\ngenerated with a pair of attributes and time-stamps as a result\nof the time quantization shown inFigure 9:\naev=\n{\naev\n푖\n|aev\n0\n,aev\n1\n,. ,aev\n푖\n=\n(\n“퐿\n푖\n”,푡푠\n푖\n)}\n. \n(6)\nThe signal representation by a set of atomic events with a\ncertain amount of error is denoted in the following equation:\ñ\nae={\ñ\nae\n푖\n|\ñ\nae\n0\n,\ñ\nae\n1\n,. ,\ñ\nae\n푖\n=(“퐿\n푖\n”,푡푠\n푖\n±Δ)}. (7)\naev\n푖\n, which is matched with the configured scan window\nAE\n푖\n, is represented as an abstracted atomic event index in\nFigure 9, which indirectly addresses the detailed attributes\nin the constant dictionary.  The continuous analog signal is\nconverted into a set of event quantized data\ñ\naev\n푖\n,andits\nindex value is traced only into the atomic event tracer buffer.",
          "Therefore, the traced event data processing manipulates the\nindex value and its relationship to the representative atomic\neventstogeneratethefinaleventEVTheproposedEPU,\nwhich is based on event quantization, provides the following\nadvantages compared to conventional sensor data processing. \n4. 5. EventBusArchitecture. The modified architecture of the\nproposed MCU includes S2E to extract atomic event aev\n푖\nfrom the activity signal instead of using ADC, event tracing\nto archive the atomic events{aev\n푖\n},andtheEPUtoanalyze\ntherelationshipbetweenthearchivedatomicevents. \nThe sensor signal in rare-event applications is described\nwith an example inFigure 2(a), which is represented with the\nthreshold level, edge phase type, and elapsed time between\nthe previously recognized signal points.  The signal features\nofinterestareusedearlytoextracttheatomiceventsinthe\nS2E unit. \nThe path from S2E to the event tracer is designed with\nthe event bus, on which the atomic event transactions are\nloaded.",
          "The predefined event types are configured in EPU\nconfiguration by the user knowing the signal characteristics\nfor which attributes are represented The EPU handles the\nindex to the events in the event table, which is stored in the\nEPU configuration. Figure 9shows data flow of the event-\nquantized atomic events.  The atomic event aev\n푖\nonly contains\na pointer to address the detailed attributes in the attribute\ntableandelapsedtimetabletosavethelimitedtracermemory\narea. \n5.  Implementation and Experimental Results\nFigure 10(a)is the data path of the implemented S2E cir-\ncuit.  The proposed S2E-based signal conversion and event\nsignal processing architecture requires additional hardware\noverhead, including a level comparator, AEG, timer, tracer\nmemory, and EPU, which are distinguished with a red dotted\nline inFigure 10(b). \nThe hardware implementation based on the proposed\nconcept requires the additional 7500 NAND gates and 1 KB\nSRAM tracer in 0. 18 um CMOS process.",
          "The implemented\ndesigns are integrated in an 8051-based microcontroller\nFigure 10(b)shows the modified event-bus architecture of the\nimplementedMCU,inwhichtheatomicevent(aev\n푖\n)isloaded\nfrom S2E.  The attributes of the user-defined atomic event,\nincluding signal features and elapsed time ranges, are stored\nas a constant table in the on-chip flash memory. \nFor power consumption measurement, the raw dump of\ntheelectricalsignalgeneratedbyhandgestureisgatheredinto\nthe host computer, as shown inFigure 10(c). Theinputstimu-\nlus of the activity signal is loaded into the circuit-level simula-\ntion environment, in which the accuracy-energy trade-off can\nbe easily performed to evaluate the energy consumption of\nthe proposed MCU architecture. \nFigure 10(d)shows  energy  consumption  reduction\naccording to the accuracy by configuring the S2E for specific\nsignal segments.",
          "Using a timer and oscillator unit with 10%\naccuracy error in the swipe-gesture recognition application,\nthe implemented MCU could still identify the gesture event,\nalthough consuming only 20% energy compared to the result\nof the accurate discrete time sampling method\nThe elapsed time resolution for the time quantization\nreduces directly the power consumption, which is constantly\nrequired to monitor the incoming signal shape.  Trade-off\nbetween the time quantization error and the power consump-\ntion reduction is performed to determine the error bound\nallowing the appropriate signal detection.  The event segmen-\ntation size also affects the power consumption reduction\nslightly, which is showed with an example of 168 events and\n104 events inFigure 10(d).",
          "The power consumption reduction\n\n8Journal of Sensors\ns(t)\nADC\ns(n)\ns(n)\nTracing\nProcessing\nAEG\ns(t)\nCMP\nTMR\nAEG: atomic event generator\nCMP: level comparator\nTMR: time-stamp timer\nTracer\nMatching\nOSC\nS2E\nIn\nOut\nProcessing\ns(0)\ns(1)\nSignal feature: ef \ns(2)\ns(3)\ns(5)\nFinal event\ns(4)\nSignal feature: ef \nISR: processing\nInput: ef, s(0), s(1), s(2), s(3), s(4), s(5)\nOutput: ev-final event\nFinal event\nFinal \nevent\nFinal \nevent\nISR: processing\nOutput: ev,\n(final event)\nDecision \nmaking \nz\n−1\nz\n−1\nz\n−1\nz\n−1\ns(n − 1)\ns(n − 2)\ns(n − c)\n\nInput:\nL\ni\n⟨⟩\n⟨⟩\n⟨⟩\n⟨⟩\nae\ni\ñ\nae\n0\ñ\nae\n1\ñ\nae\n2\ñ\nae\n5\nae\n0\nae\n0\nae\n1\nae\n1\nae\n2\nae\n2\nae\n5\nae\n0\n,ae\n1\n,ae\n2\nAE\n0\nAE\n1\nAE\n2\nAE\n5\nFigure 8: Comparison of conventional digital signal processing versus event-driven signal processing. \nAEG\nSensor \nanalog \nI/F\nAEG: atomic event generator\nESP: event-signal processing\nfet: feature attribute\nelt: elapsed time\nidx\n0\n1\n2\nk\nFeature\nAdd new \nfeature\nidx\n0\n1\n2\nm\nElapsed time\nESP\nEvent tracer\n.",
          "···\n⟨\n⟨\n⟩\nsa\nΔi\nAEG({sa\nΔi\n})→{aev\ni\n}, {fet\nk\n}, {elt\nm\n}\nidx\nm\n,\n  \n[\nrange\n]\nidx\nk\n,\nattribute\nk\nm\n[range]\nm\n[range]\n0\n[range]\n1\n[range]\n2\n⟩\nAEV={aev\ni\naev\n0\n,\naev\ni\naev\n3\naev\n2\naev\n1\naev\n0\n{aev\ni\n},\n{aev\ni\n}\n{fet\nk\n},{elt\nm\n})→{ev\nn\n}\nFET={fet\nk\nfet\n0\n,fet\n1\n,fet\n2\n,,\nfet\nk\n=⟨idx\nk\n,attribute\nk\n⟩}\nELT={elt\nm\nelt\n0\n,elt\n1\n,elt\n2\n,. ,\nelt\nm\n=⟨idx\nm\n,[range]\nm\n⟩}\n{\nev\nn\n}\n{\nfet\nk\n}\n{\nelt\nm\n}\nESP(\n|\naev\ni\n=⟨FTBL·idx\nx\n,ELTBL·elt\ny\n⟩}\naev\n1\n,. ,aev\nn\n,\nk\nAttribute\nAttribute\nAttribute\nAttribute\n0\n1\n2\n|\n|\nFigure 9: Index-based feature table including attributes and elapsed time range. \nis dependent on the event-quantization accuracy controlled\nby time measurement resolution and event segmentation size. \n6.  Conclusion\nThe macrolevel signal processing concept is based on the early\nevaluation of incoming sensor signal data by the S2E.  The\nsignal-specific signal segmentation with the features of inter-\nest enables the atomic event extraction from the continuous\nsensor data signal.",
          "The early evaluation of the signal features\nenables the entire system in sleep mode, with the exception\nof the S2E, to consume relatively little current The extracted\nsmallnumberofatomiceventsisanalyzedbytheEPU,which\nwill traverse the reduced state space.  The proposed method\nrequires the additional hardware by modifying the conven-\ntional MCU bus architecture and the user must perform the\niterative configuration on the S2E and EPU carefully after\nanalyzing the signal characteristics for rare-event activity-\nsensing applications until the reasonable power reduction\nis accomplished.",
          "The event-space representation and signal\nabstraction of atomic events extracted by S2E could reduce\nthe data processing cost in terms of the energy consumption\n\nJournal of Sensors9\nADC\nCMP\nTMR, OSC\nTracer memory {aev}\nSensor\nanalog front-end\nAtomic event data processing\nWait-time\nOn/Off\nOn/Off\nTr i g g e r\n1st signal-to-event \nconversion (S2E)\n2nd detail \nsampling\nOn/Off\nReport\nReport\nMain processor\nAEG\nPhase, level\n(a) S2E circuit data path\nMCU CPU \nBuffer\nCode memory \n(flash)\nSignal-to-event \nconverter (S2E)\nAnalog \nfront-end\nEvent tracer\nEvent type\nEvent signal \nprocessor\nEPU \nconfiguration \n(flash)\nSensor signal\nTime counter\n(OSC, timer)\nCPU bus\nEvent bus\nDMADMA\nEvent \nreport\ncore\n(SRAM)\n(EPU)\nΔ\ne\nΔ\ne\ndictionary\n∗\naev\nk\n,=⟨\n∗\net\nk\n,\n∗\nta\nk\n⟩\naev\n0\n,aev\n1\n,,aev\nk\n,\n∗\naev\n0\n,\n∗\naev\n1\n,. ,\n∗\naev\nk\n,\net\n0\n,et\n1\n,. ,et\nk\n,\nta\n0\n,ta\n1\n,. ,ta\nk\n,\n∗\nPointer index\n(\n∗\n. h,\n∗\n.",
          "c)\n(b) Modified microcontroller bus architecture\nCircuit-level simulator\nSensor \nprocessor\nAnalog \nfront-end\nSensor device + MATLAB \n$fread()\nCircuit netlist \nHand \ngesture\nevent\nDump raw data \nof sensed signal\nLoading strobe vector\n(nanosim, primetime ©)\n(c) Measurement environment\n0\n100\n200\n300\n400\n500\n600\n700\n800\n900\n1000\n5000\n10000\n15000\n20000\n25000\nOperating lifetime (hours)\nOperating current and accuracy of time quantizer block\nEnergy consumption and lifetime comparison:\ntime-stamps measurement (OSC + time) current sweep\nEnergy (168 events/s)\nEnergy (104 events/s)\nLifetime (168 events/s)\nLifetime (104 events/s)\n휇\nA (\n15\n%)\n612\n휇\nA (\n2\n%)\n480\n휇\nA (\n3\n%)\n222\n휇\nA (\n5\n%)\n145\n휇\nA (\n10\n%)\n91\n휇\nA (\n20\n%)\n66\n휇\nA (\n25\n%)\nEnergy consumption (\n휇\nJ) during\n1\n second\n845\n(d) Energy consumption according to event quantization error\nFigure 10: Implemented circuit and experimental results. \nby considering specific characteristics of signals observed\nin rare-event sensing applications.",
          "The experimental result\nshows that the proposed method is an effective way to provide\nthe power reduction\nConflict of Interests\nThe authors declare that there is no conflict of interests\nregarding the publication of this paper. \nAcknowledgments\nThisresearchwassupportedbyBasicScienceResearch\nProgram  through  the  National  Research  Foundation\nof Korea (NRF) funded by the Ministry of Education\n(2014R1A6A3A04059410), the MSIP (Ministry of Science,\nICT & Future Planning), Korea, under the C-ITRC (Conver-\ngence Information Technology Research Center) support\nprogram (NIPA-2014-H0401-14-1004) supervised by the\nNIPA (National IT Industry Promotion Agency), and the\n2013 Yeungnam University Research Grant. \nReferences\n[1] L. Chen,J. Hoey,C. D. Nugent,D. J. Cook,andZ. Yu,“Sensor-\nbased activity recognition,”IEEE Transactions on Systems, Man\nand Cybernetics Part C: Applications and Reviews,vol. 42,no. 6,\npp. 790–808,2012. \n[2]\n ́\nO. D. LaraandM. A.",
          "Labrador,“Asurveyonhumanactivity\nrecognition using wearable sensors,”IEEE Communications\nSurveys and Tutorials,vol15,no. 3,pp. 1192–1209,2013. \n[3] K.  Van Laerhoven, H. -W.  Gellersen, and Y.  G.  Malliaris, “Long-\nterm activity monitoring with a wearable sensor node,” in\nInternational Workshop on Wearable and Implantable Body\nSensor Networks (BSN ’06), pp.  171–174, April 2006. \n[4] K.  Leuenberger and R.  Gassert, “Low-power sensor module\nfor long-term activity monitoring,” inProceedings of the 33rd\n\n10Journal of Sensors\nAnnual International Conference of the IEEE Engineering in\nMedicine and Biology Society (EMBS ’11),pp. 2237–2241,\nSeptember 2011. \n[5] Y.  Tsividis, “Event-driven data acquisition and digital signal\nprocessing—a tutorial,”IEEE Transactions on Circuits and\nSystems II: Express Briefs,vol. 57,no. 8,pp. 577–581,2010. \n[6] P.  Panek, “Error analysis and bounds in time delay estimation,”\nIEEE Transactions on Signal Processing,vol. 55,no. 7,pp. 3547–\n3549, 2007. \n[7] Y.",
          "Tsividis, “Event-driven data acquisition and continuous-time\ndigital signal processing,” inProceedings of the 32nd Annual\nCustom Integrated Circuits Conference (CICC ’10),pp1–8,\nSeptember 2010. \n[8] B.  Schell and Y.  Tsividis, “Analysis of continuous-time digital\nsignal processors,” inProceedings of the IEEE International\nSymposium on Circuits and Systems (ISCAS ’07),pp. 2232–2235,\nMay 2007. \n[9] Y.  Yilmaz, G.  Moustakides, and X.  Wang, “Spectrum sensing via\nevent-triggered sampling,” inProceedings of the 45th Asilomar\nConference on Signals, Systems and Computers (ASILOMAR ’11),\npp. 1420–1424,November2011. \n[10] M.  Mi\n ́\nskowicz, “The event-triggered integral criterion for\nsensor sampling,” inProceedings of the IEEE International\nSymposiumonIndustrialElectronics(ISIE’05),vol. 3,pp. 1061–\n1066, June 2005. \n[11] B.  French, D.  P.  Siewiorek, A.  Smailagic, and M.",
          "Deisher,\n“Selective sampling strategies to conserve power in context\naware devices,” inProceedings of the 11th IEEE International\nSymposium on Wearable Computers (ISWC ’07),pp77–80,\nOctober 2007. \n[12] W.  Li, M.  Bandai, and T.  Watanabe, “Tradeoffs among delay,\nenergy and accuracy of partial data aggregation in wireless\nsensor networks,” inProceedings of the 24th IEEE International\nConference on Advanced Information Networking and Applica-\ntions (AINA ’10), pp.  917–924, April 2010. \n[13] K.  Choi, R.  Soma, and M.  Pedram, “Fine-grained dynamic\nvoltage and frequency scaling for precise energy and perfor-\nmance tradeoff based on the ratio of off-chip access to on-\nchip computation times,”IEEE Transactions on Computer-Aided\nDesign of Integrated Circuits and Systems,vol. 24,no. 1,pp. 18–\n28, 2005. \n[14] Y.  Lee, J.  Kim, and C. -M.",
          "Kyung, “Energy-aware video encoding\nfor image quality improvement in battery-operated surveillance\ncamera,”IEEE Transactions on Very Large Scale Integration\n(VLSI) Systems, vol 20, no.  2, pp.  310–318, 2012. \n[15]V. Gupta,D. Mohapatra,A. Raghunathan,andK. Roy,“Low-\npower digital signal processing using approximate adders,”\nIEEE Transactions on Computer-Aided Design of Integrated\nCircuits and Systems,vol. 32,no. 1,pp. 124–137,2013. \n[16] A.  B.  Kahng and S.  Kang, “Accuracy-configurable adder for\napproximate arithmetic designs,” inProceedings of the 49th\nAnnual Design Automation Conference (DAC ’12), pp.  820–825,\nACM, New York, NY, USA, June 2012."
        ],
        "updatedAt": "2025-08-11T19:35:21.221Z"
      }
    ]
  ],
  "conversations": [],
  "messages": []
}